from crewai import Task
from datetime import date
from textwrap import dedent


class AgentTasks ():
    
    def search_travel(self, agent):
        today = date.today()
        return Task(description = "ช่วยแนะนำสถานที่ท่องเที่ยวยอดนิยมในจังหวัดภาคเหนือ โดยระบุข้อมูลสำคัญ เช่น ชื่อสถานที่, ประเภท, จุดเด่น และพิกัด เพื่อให้ผู้ใช้สามารถวางแผนการเดินทางได้อย่างมีประสิทธิภาพ",
                    expected_output = dedent(f"""
                                            ค้นหาสถานที่ท่องเที่ยวในภาคเหนือในจังหวัด เชียงใหม่, เชียงราย, แม่ฮ่องสอน,       เพชรบูรณ์และน่านจำเป็นต้องค้นหาสถานที่ท่องเที่ยวที่เป็นข้อมูลที่ถูกต้องและมีความสำคัญพร้อมรายละเอียดที่เป็นประโยชน์แก่นักเที่ยว
                                            """), agent = agent)
    
    def analyze_travel(self, agent):
        return Task(description = "",
                    expecgted_output = dedent(f"""
                                            วิเคราะห์สถานที่ท่องเที่ยวยอดนิยมจังหวัดเชียงใหม่, เชียงราย, แม่ฮ่องสอน, เพชรบูรณ์, น่าน ที่ได้รับมาวิเคราะห์ เพื่อนำข้อมูลสถานที่ท่องเที่ยวมาสรุปให้นักท่องเที่ยว
                                            """), agent = agent)

    def summarize_travel(self, agent):
        return Task(description = "สรุปสถานที่ท่องเที่ยวที่ได้รับ โดยนำสถานที่ท่องเที่ยวที่ได้รับมาสรุปให้สั้นกระชับและเข้าใจง่าย",
                    expected_output = "สรุปสถานที่ท่องเที่ยวที่ได้ทำการวิเคราะห์มาแล้วให้กระชับเข้าใจง่าย",
                    agent = agent)
    
    def writer_travel(self, agent):
        return Task(description = "นักเขียนที่ชำนาญในการเขียนสถานที่ท่องเที่ยวยอดนิยมในจังหวัด เชียงใหม่, เชียงราย, แม่ฮ่องสอน, เพชรบูรณ์และน่าน มีความสามารถในการเขียนสถานที่ท่องเที่ยวยอดนิยมในจังหวัดเหล่านี้ให้สรุปและเข้าใจง่าย",
                    expected_output = "เขียนสถานที่ท่องเที่ยวตามข้อมูลที่ได้รับมา โดยนำข้อมูลสถานที่ท่องเที่ยวที่ได้รับมา มาเขียนสรุปและเข้าใจง่าย",
                    agent = agent)
    
    def translator_travel(self, agent):
        return Task(description = "แปลบทความสถานที่ท่องเที่ยวยอดนิยมที่ได้รับจากภาษาอังกฤษเป็นภาษาเป้าหมาย",
                    expected_output = "แปลบทความสถานที่ท่องเที่ยวยอดนิยมที่ได้รับจากภาษาอังกฤษเป็นภาษาเป้าหมาย โดยทำให้เนื้อหาสามารถเข้าใจได้ง่ายและถูกต้องทางภาษา รวมถึงรักษาความหมายเดิมของสถานที่ท่องเที่ยวโดยไม่บิดเบือน",
                    output_file = 'travel_output.txt',
                    agent = agent)
    